OdGsView.ssaoMode
\details
Returns ambient occlusion mode for current Viewport object.
\returns true if ambient occlusion enabled for current view or false otherwise.

OdGsView.enableSSAO(System.Boolean)
\details
Enables or disables ambient occlusion in current Viewport object.
\param bEnable [in]  Ambient occlusion mode (set as true by default). Set as false to disable ambient occlusion.

OdGsView.antiAliasingMode
\details
Returns anti-aliasing mode for current Viewport object.

OdGsView.enableAntiAliasing(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Enables or disables anti-aliasing in current Viewport object.
\param nMode [in]  Anti-aliasing mode (set as 3 by default). Set as 0 to disable anti-aliasing.

OdGsView.rayTrace(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsRayTraceReactor*,System.Boolean,OdGiPathNode!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Runs ray tracing procedure inside this Viewport object.
\param rayOrigin [in]  Origin of tracing ray in World Coordinates System.
\param rayDirection [in]  Direction of tracing ray in World Coordinates System.
\param pReactor [in]  Ray tracing callback reactor.
\param bSortedSelection [in]  Enables ordered ray tracing instead of random.
\param pObjectList [in]  Optional list of graphic scene objects participating in ray tracing.
\param nObjectListSize [in]  Number of objects inside pObjectList.

OdGsView.getSnapShot(OdSmartPtr&lt;OdGiRasterImage&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns image of current view buffer.
\param pImage [out]  Pointer for image to return.
\param region [in]  Rectangle specifies region to return.
\remarks
Implementation can throw eNotImplementedYet exception if current vectorization module doesn't support snap shots.

OdGsView.getNumPixelsInUnitSquare(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns the display pixel density at the specified point for this Viewport object.
\param point [in]  WCS center of the unit square.
\param pixelDensity [out]  Receives the pixel density.
\param bUsePerspective [in]  Enable perspective inclusion into pixel density calculation.
\remarks
Pixel density is measured in pixels per WCS unit.
This function can be used to determine if the geometry generated for an object will
be smaller than the size of a pixel.

OdGsView.pointInViewport(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified point is inside viewport area.
\param screenPoint [in]  Check point in device coordinate space.
\returns
true if the passed point is inside the viewport, false otherwise.

OdGsView.setClearColor(OdGsView.ClearColor)
\details
Sets the clear color for this view
\param color [in]  The clear color.

OdGsView.clientViewInfo(OdGsClientViewInfo*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the ClientViewInfo for this Viewport object.
\param clientViewInfo [out]  Receives the ClientViewInfo.

OdGsView.linetypeAlternateScaleMultiplier
\details
Returns current alternate linetype scale multiplier value.
\sa
Working with Linetypes

OdGsView.setAlternateLinetypeScaleMultiplier(System.Double)
\details
Sets a multiplier that could be used as an alternate scale factor for linetypes in this Viewport object.
\param linetypeAlternateScaleMultiplier [in]  Alternate linetype scale multiplier.
\sa
Working with Linetypes

OdGsView.linetypeScaleMultiplier
\details
Returns current linetype scale multiplier value.
\sa
Working with Linetypes

OdGsView.setLinetypeScaleMultiplier(System.Double)
\details
Sets a multiplier that is used to scale all linetypes in this Viewport object.
\param linetypeScaleMultiplier [in]  Linetype scale multiplier.

OdGsView.initLights(OdRxIterator*)
\details
Returns an iterator to traverse the lights attached to this Viewport object.
\param pLightsIterator [in]  Pointer to the lights iterator.

OdGsView.getStereoParameters(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the stereo parameters for this Viewport Object.
\param magnitude [out]  Receives the view separation [0.0 .. 2.0].
\param parallax [out]  Receives the plane of zero parallax adjustment [0.0 .. 2.0].
\remarks
magnitude controls view eye separation, and hence the stereo effect.
* A magnitude of 1.0 is the default value.
* A magnitude of 0.0 produces no stereo effect.
* A magnitude of 2.0 produces a double stereo effect.
parallax adjusts the zero parallax plane.
* A parallax of 1.0 is the default value. An object centered at the target will be half-in and half-out of the screen.
* A parallax of 0.0 moves the object into the screen.
* A parallax of 2.0 move the object out of the screen.

OdGsView.setStereoParameters(System.Double,System.Double)
\details
Sets the stereo parameters for this Viewport Object.
\param magnitude [in]  View separation [0.0 .. 2.0].
\param parallax [in]  Adjusts the plane of zero parallax [0.0 .. 2.0].
\remarks
magnitude controls view eye separation, and hence the stereo effect.
* A magnitude of 1.0 is the default value.
* A magnitude of 0.0 produces no stereo effect.
* A magnitude of 2.0 produces a double stereo effect.
parallax adjusts the zero parallax plane.
* A parallax of 1.0 is the default value. An object centered at the target will be half-in and half-out of the screen.
* A parallax of 0.0 moves the object into the screen.
* A parallax of 2.0 move the object out of the screen.

OdGsView.isStereoEnabled
\details
Checks whether stereo viewing is enabled for this Viewport object.
\returns
true if and only if stereo viewing is enabled for this Viewport object, false otherwise.

OdGsView.enableStereo(System.Boolean)
\details
Controls stereo viewing for this Viewport object.
\param enable [in]  Controls stereo viewing.

OdGsView.exceededBounds
\details
Checks whether any view parameters have exceeded their boundaries since the last
call to this function.
\returns
true if any view parameters have exceeded their boundaries since the last call to this function, false otherwise.
\remarks
The following calls are monitored:
* dolly()
* orbit()
* pan()
* roll()
* setBackClip()
* setFrontClip()
* setView()
* zoom()

OdGsView.viewParameters(OdGsView*)
\details
Sets the view parameters of the specified OdGsView object to that of this Viewport object.
\param pView [out]  Receives the view parameters.

OdGsView.cloneView(System.Boolean,System.Boolean)
\details
Clones this view object.
\param cloneViewParameters [in]  If and only if true, view parameters will be cloned.
\param cloneGeometry [in]  If and only if true, geometry will be cloned.
\returns
Returns a SmartPointer to the newly created object.

OdGsView.extentsInView(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether specified WCS box is visible completely or partially inside current view frustum.
\param minPt [in]  minimal WCS box point.
\param maxPt [in]  maximal WCS box point.
\returns
true if the specified extents box is visible in the current viewport frustum of the wrapped view, false otherwise.

OdGsView.pointInView(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether specified point is visible inside current view frustum.
\param pt [in]  WCS point for check.
\returns
true if the specified point is visible in the wrapped viewport, false otherwise.

OdGsView.zoomWindow(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Scales the camera to completely include specified screen area.
\param lowerLeft [in]  Lower-left corner in nomalized device coordinates [0.0 .. 1.0].
\param upperRight [in]  Upper-right corner in nomalized device coordinates [0.0 .. 1.0].

OdGsView.zoomExtents(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Scales the camera to completely include specified WCS box inside view frustum.
\param minPt [in]  minimal WCS box point.
\param maxPt [in]  maximal WCS box point.

OdGsView.pan(System.Double,System.Double)
\details
Rotates the target about the camera the specified amounts.
\param xPan [in]  X-axis pan.
\param yPan [in]  Y-axis pan.
\remarks
The target moves on the surface a sphere whose center the camera position and whose
radius is the distance from the camera position to its target.
* The target is first rotated about an axis parallel to the X-axis and passing through the camera.
* The target is next rotated about an axis parallel to the Y-axis and passing through the camera.
Camera Coordinates are relative to the view of a target from a camera.
* The Y-axis is along up vector.
* The Z-axis is along the vector from camera position to the target.
* The X-axis is the cross product Y-axis x Z-axis
All angles are expressed in radians.

OdGsView.zoom(System.Double)
\details
Scales the focal length of the camera by the specified amount.
\param zoomFactor [in]  Zoom factor.

OdGsView.orbit(System.Double,System.Double)
\details
Orbits the camera about the target by the specified amounts.
\param xOrbit [in]  X-axis Orbit.
\param yOrbit [in]  Y-axis Orbit.
\remarks
the camera moves on the surface a sphere whose center the camera target and whose
radius is the distance from the camera position to its target
* The camera is first rotated about an axis parallel to the X-axis and passing through the target.
* The camera is next rotated about an axis parallel to the Y-axis and passing through the target.
Camera Coordinates are relative to the view of a target from a camera.
* The Y-axis is along up vector.
* The Z-axis is along the vector from camera position to the target.
* The X-axis is the cross product Y-axis x Z-axis
All angles are expressed in radians.

OdGsView.roll(System.Double)
\details
Rotates the camera by the specified amount about the eye vector.
\param rollAngle [in]  Camera CCW roll angle.
\remarks
Positive angles rotate the camera counterclockwise about the eye vector
when viewed from the camera position to the target. This corresponds
to a clockwise rotation of the up vector.
Camera Coordinates are relative to the view of a target from a camera.
* The Y-axis is along up-vector.
* The Z-axis (eye vector) is along the vector from camera position to the target.
* The X-axis is the cross product Y-axis x Z-axis.
All angles are expressed in radians.

OdGsView.dolly(System.Double,System.Double,System.Double)
\details
Translates the camera position and target by the specified Camera Coordinate dolly amount.
\param xDolly [in]  Camera Coordinate X dolly amount.
\param yDolly [in]  Camera Coordinate Y dolly amount.
\param zDolly [in]  Camera Coordinate Z dolly amount.
\remarks
Camera Coordinates are relative to the view of a target from a camera.
* The Y-axis is along up vector.
* The Z-axis is along the vector from camera position to the target.
* The X-axis is the cross product Y-axis x Z-axis

OdGsView.dolly(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Translates the camera position and target by the specified Camera Coordinate dolly amount.
\param dollyVector [in]  Camera Coordinate dolly vector.
\remarks
Camera Coordinates are relative to the view of a target from a camera.
* The Y-axis is along up vector.
* The Z-axis is along the vector from camera position to the target.
* The X-axis is the cross product Y-axis x Z-axis

OdGsView.invalidateCachedViewportGeometry
\details
Marks for regeneration all subViewportDraw() geometry for this Viewport object.

OdGsView.isVisible
\details
Checks whether the viewport object is not hidden.
\returns
true if the wrapped viewport object is visible, false otherwise.

OdGsView.show
\details
Un-hides this Viewport object.

OdGsView.hide
\details
Hides this Viewport object.

OdGsView.flush
\details
Flushes the graphic pipeline and renders this Viewport object.
\remarks
This function should be called only during interactivty.

OdGsView.update
\details
Flushes any queued graphics to the display device.
\remarks
If called while this Viewport object is in the interactive state, this function immediately returns.

OdGsView.isValid
\details
Checks whether this Viewport shows the correct image.
\returns
true if this Viewport object is showing the correct image, false otherwise.
\remarks
This implies the follow:
* No part of GUI area is flagged for refresh.
* All rasterizations are complete
* The rendering pipeline has been flushed.

OdGsView.invalidate(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Marks for refresh the specified region of this Viewport object.
\param screenRect [in]  Screen rectangle in device coordinates (pixels).

OdGsView.invalidate
\details
Marks the entire area of this View for refreshing.

OdGsView.getModelList
\details
Returns array of OdGsModel objects associated with this Viewport object.

OdGsView.getModel(OdGiDrawable!System.Runtime.CompilerServices.IsConst*)
\details
Returns OdGsModel object associated with specified OdGiDrawable object in this Viewport object.
\param pDrawable [in]  Pointer onto OdGiDrawable object.

OdGsView.eraseAll
\details
Removes all scene graphs from this Viewport object.
\param sceneGraph [in]  Root of scene graph.

OdGsView.erase(OdGiDrawable*)
\details
Removes the specified scene graph from this Viewport object.
\param sceneGraph [in]  Pointer to the root of the scene graph.
\returns
true if scene graph is successfully erased, false otherwise.

OdGsView.rootDrawableAt(System.Int32,OdSmartPtr&lt;OdGsModel&gt;*)
\details
Retrieves a smart pointer to the root drawable at the specified index.
\param i [in]  Index of the drawable to return.
\param pModelReturn [in/out]  If not NULL, receives a pointer to model of associated drawable holder.

OdGsView.rootDrawableIdAt(System.Int32,OdSmartPtr&lt;OdGsModel&gt;*)
\details
Retrieves a persistent object identifier of the root drawable at the specified index.
\param i [in]  Index of the drawable to return.
\param pModelReturn [in/out]  If not NULL, receives a pointer to model of associated drawable holder.

OdGsView.numRootDrawables
\details
Retrieves a quantity of root drawables for this viewport.

OdGsView.add(OdGiDrawable*,OdGsModel*)
\details
Adds the specified scene graph to this Viewport object.
\param pSceneGraph [in]  Pointer to the root of the scene graph.
\param pModel [in]  Pointer to the Model object to which all scene graph notifications are to be directed.
\remarks
This function is intended to be used as follows:
1.  Construct a scene graph of OdGiDrawable objects.
Each object draws its children with OdGiGeometry::draw().
2.  With this function, add the root of the scene graph and the
OdGsModel that handles notifications to this Viewport object.

OdGsView.mode
\details
Sets the render mode for this Viewport object.
\remarks
mode must be one of the following:
Name                            Value      Description
kBoundingBox                    -1         Bounding box. For internal use only.
k2DOptimized                    0          Standard display. Optimized for 2D.
kWireframe                      1          Standard display. Uses 3D pipeline.
kHiddenLine                     2          Wireframe display. Hidden lines removed.
kFlatShaded                     3          Faceted display. One color per face.
kGouraudShaded                  4          Smooth shaded display. Colors interpolated between vertices.
kFlatShadedWithWireframe        5          Faceted display with wireframe overlay.
kGouraudShadedWithWireframe     6          Smooth shaded display with wireframe overlay.

OdGsView.setMode(OdGsView.RenderMode)
\details
Sets the render mode for this Viewport object.
\param mode [in]  Render mode.
\remarks
mode must be one of the following:
Name                            Value      Description
kBoundingBox                    -1         Bounding box. For internal use only.
k2DOptimized                    0          Standard display. Optimized for 2D.
kWireframe                      1          Standard display. Uses 3D pipeline.
kHiddenLine                     2          Wireframe display. Hidden lines removed.
kFlatShaded                     3          Faceted display. One color per face.
kGouraudShaded                  4          Smooth shaded display. Colors interpolated between vertices.
kFlatShadedWithWireframe        5          Faceted display with wireframe overlay.
kGouraudShadedWithWireframe     6          Smooth shaded display with wireframe overlay.

OdGsView.objectToDeviceMatrix
\details
Returns the matrix that transforms coordinates from model space to screen space for this Viewport object.
\sa
Coordinate Systems.

OdGsView.worldToDeviceMatrix
\details
Returns a matrix that transforms coordinates from world space to screen space for this Viewport object.
\remarks
This is equivalent to the concatenation of the viewingMatrix,
projectionMatrix, and screenMatrix.
\sa
Coordinate Systems.

OdGsView.screenMatrix
\details
Returns the matrix that transforms normalized device space to screen space for this Viewport object.
\sa
Coordinate Systems.

OdGsView.projectionMatrix
\details
Returns the matrix that transforms view space to normalized device space for this Viewport object.
\sa
Coordinate Systems.

OdGsView.viewingMatrix
\details
Returns the matrix that transforms world space to view space for this Viewport object.
\sa
Coordinate Systems.

OdGsView.backClip
\details
Returns the back clip distance from the target of this Viewport object.

OdGsView.setBackClip(System.Double)
\details
Sets the back clip distance from the target of this Viewport object.
\param backClip [in]  Back clip distance.

OdGsView.isBackClipped
\details
Checks whether back clipping is enabled for the viewport object.
\returns
true if back clipping is enabled for the viewport object, false otherwise.

OdGsView.setEnableBackClip(System.Boolean)
\details
Controls the back clipping of this Viewport object.
\param enable [in]  Enable back clipping.

OdGsView.frontClip
\details
Returns the front clip distance from the target of this Viewport object.

OdGsView.setFrontClip(System.Double)
\details
Sets the front clip distance from the target of this Viewport object.
\param frontClip [in]  Front clip distance.

OdGsView.isFrontClipped
\details
Checks whether front clipping is enabled for the viewport object.
\returns
true if front clipping is enabled for the viewport object, false otherwise.

OdGsView.setEnableFrontClip(System.Boolean)
\details
Controls the front clipping of this Viewport object.
\param enable [in]  Enable front clipping.

OdGsView.fieldHeight
\details
Returns the WCS projection plane (field) height for this Viewport object.

OdGsView.fieldWidth
\details
Returns the WCS projection plane (field) width for this Viewport object.

OdGsView.isPerspective
\details
Checks whether the projection type for the viewport object is kPerspective.
\returns
true if projection type for the viewport object is kPerspective, false otherwise.

OdGsView.setLensLength(System.Double)
\details
Sets the perspective lens length for this Viewport object.
\param lensLength [in]  Perspective lens length.

OdGsView.lensLength
\details
Returns the perspective lens length for this Viewport object.

OdGsView.upVector
\details
Returns the WCS camera up vector for this Viewport object.

OdGsView.target
\details
Returns the WCS camera target for this Viewport object.

OdGsView.position
\details
Returns the WCS camera position for this Viewport object.

OdGsView.setView(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Double,OdGsView.Projection)
\details
Sets the camera parameters for this Viewport object.
\param position [in]  Camera position.
\param target [in]  Camera target.
\param upVector [in]  Camera up vector.
\param fieldWidth [in]  Projection plane (field) width.
\param fieldHeight [in]  Projection plane (field) height.
\param projectionType [in]  Projection type.
\remarks
This method defines the transfomation from WCS coordinates to normalized device coordinates.
All parameters are in WCS coordinates.
projectionType must be one of the following:
Name           Value
kParallel      0
kPerspective   1

OdGsView.isViewportBorderVisible
\details
Checks whether viewport border is visible.
\returns
true if the border is visible for this Viewport object, false otherwise.

OdGsView.setViewportBorderVisibility(System.Boolean)
\details
Controls the border visibility for this Viewport object.
\param visible [in]  Controls visibility.

OdGsView.getViewportBorderProperties(System.UInt32!System.Runtime.CompilerServices.IsLong*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the color and width of the border for this Viewport object.
\param color [out]  Receives the border color.
\param width [out]  Receives the border width in pixels.

OdGsView.setViewportBorderProperties(System.UInt32!System.Runtime.CompilerServices.IsLong,System.Int32)
\details
Sets the color and width of the border for this Viewport object.
\param color [in]  Border color.
\param width [in]  Border width in pixels.

OdGsView.removeViewport3dClipping
\details
Removes the 3d clipping from this Viewport object.

OdGsView.viewport3dClipping(OdGiAbstractClipBoundary!System.Runtime.CompilerServices.IsConst**)
\details
Returns the current 3d clipping for this Viewport object.
\param ppClipInfo [out]  Optional 3d clipping boundary extended data.
\remarks
Returns null if 3d clipping boundary doesn't set.

OdGsView.setViewport3dClipping(OdGiClipBoundary!System.Runtime.CompilerServices.IsConst*,OdGiAbstractClipBoundary!System.Runtime.CompilerServices.IsConst*)
\details
Defines the 3d clipping for this Viewport object.
\param pBoundary [in]  3d clipping boundary.
\param pClipInfo [in]  Optional 3d clipping boundary extended data.

OdGsView.removeViewportClipRegion
\details
Removes the polygonal clip region for this Viewport object.

OdGsView.viewportClipRegion(OdArray&lt;System.Int32,OdMemoryAllocator&lt;System.Int32&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdGePoint2d,OdMemoryAllocator&lt;OdGePoint2d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a polygonal clip region for this Viewport object.
\param counts [out]  Array of the number of vertices in each polygonal contour.
\param vertices [out]  Array of device coordinate (pixel) vertices defining the polygonal contours.

OdGsView.viewportClipRegion(OdArray&lt;System.Int32,OdMemoryAllocator&lt;System.Int32&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdGsDCPoint,OdMemoryAllocator&lt;OdGsDCPoint&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a polygonal clip region for this Viewport object.
\param counts [out]  Array of the number of vertices in each polygonal contour.
\param vertices [out]  Array of device coordinate (pixel) vertices defining the polygonal contours.

OdGsView.setViewportClipRegion(System.Int32,System.Int32!System.Runtime.CompilerServices.IsConst*,OdGePoint2d!System.Runtime.CompilerServices.IsConst*)
\details
Defines a polygonal clip region for this Viewport object.
\param numCoutours [in]  Number of polygonal contours.
\param numVertices [in]  Array of the number of vertices in each polygonal contour.
\param vertices [in]  Array of device coordinate (pixel) vertices defining the polygonal contours.

OdGsView.setViewportClipRegion(System.Int32,System.Int32!System.Runtime.CompilerServices.IsConst*,OdGsDCPoint!System.Runtime.CompilerServices.IsConst*)
\details
Defines a polygonal clip region for this Viewport object.
\param numCoutours [in]  Number of polygonal contours.
\param numVertices [in]  Array of the number of vertices in each polygonal contour.
\param vertices [in]  Array of device coordinate (pixel) vertices defining the polygonal contours.

OdGsView.getViewport(OdGsDCRectDouble*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the size and position of this Viewport object.
\param screenRect [out]  Receives the screen rectangle in device coordinates (pixels).
\remarks
(0,0) is the lower-left corner of the owning Device object.  Coordinates increase upward and to the right.
The View object may be partly or completely off screen.

OdGsView.getViewport(OdGsDCRect*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the size and position of this Viewport object.
\param screenRect [out]  Receives the screen rectangle in device coordinates (pixels).
\remarks
(0,0) is the lower-left corner of the owning Device object.  Coordinates increase upward and to the right.
\remarks
The View object may be partly or completely off screen.

OdGsView.getViewport(OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the size and position of this Viewport object.
\param lowerLeft [out]  Receives the lower-left corner in nomalized device coordinates [0.0 .. 1.0].
\param upperRight [out]  Receives the upper-right corner in nomalized device coordinates [0.0 .. 1.0].
\remarks
(0,0) is the lower-left corner of the owning Device object.  Coordinates increase upward and to the right.
\remarks
The View object may be partly or completely off screen.

OdGsView.setViewport(OdGsDCRectDouble!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the size and position of this Viewport object.
\param screenRect [in]  Screen rectangle in device coordinates (pixels).
\remarks
(0,0) is the lower-left corner of the owning Device object. Coordinates increase upward and to the right.
The View object can be partly or completely off screen.

OdGsView.setViewport(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the size and position of this Viewport object.
\param screenRect [in]  Screen rectangle in device coordinates (pixels).
\remarks
(0,0) is the lower-left corner of the owning Device object. Coordinates increase upward and to the right.
\remarks
The View object can be partly or completely off screen.

OdGsView.setViewport(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the size and position of this Viewport object.
\param lowerLeft [in]  Lower-left corner in nomalized device coordinates [0.0 .. 1.0].
\param upperRight [in]  Upper-right corner in nomalized device coordinates [0.0 .. 1.0].
\remarks
(0,0) is the lower-left corner of the owning Device object. Coordinates increase upward and to the right.
The View object can be partly or completely off screen.

OdGsView.setUserGiContext(OdGiContext*)
\details
Sets the User Context object associated with this Viewport object.
\param pUserGiContext [in]  Pointer to the User Context.

OdGsView.userGiContext
\details
Returns the GiContext object associated with this Viewport object.